## Staging: glue
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                   |
|--------|-----------------------------------------|
| add    | `aws_glue_job.submissions_glue_job`     |
|        | `aws_s3_object.submissions_glue_script` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_job.submissions_glue_job will be created
  + resource "aws_glue_job" "submissions_glue_job" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--cloudwatch_endpoint"              = "/aws/lambda/Submission"
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/error-logs"
          + "--continuous-log-logStreamPrefix"   = "rds_glue_job_error_log_stream"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--s3_endpoint"                      = "cds-forms-data-lake-bucket-staging"
        }
      + glue_version           = "4.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + name                   = "submissions_glue_job"
      + number_of_workers      = (known after apply)
      + role_arn               = "arn:aws:iam::687401027353:role/service-role/AWSGlueETL-DataLake"
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = (known after apply)

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://cds-forms-data-etl-bucket-staging/submissions_etl.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_s3_object.submissions_glue_script will be created
  + resource "aws_s3_object" "submissions_glue_script" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-forms-data-etl-bucket-staging"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "da8362d20a958b8c2f66431298e52f5c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "submissions_etl.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./scripts/submissions_etl.py"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.glue_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.rds_db_catalog"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_connection.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.forms_historical_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.forms_rds_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.historical_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.rds_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.submissions_glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.rds_glue_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_s3_replicate"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.forms_s3_replicate"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.glue_script"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.historical_csv"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.historical_glue_script"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.submissions_glue_script"]

39 tests, 19 passed, 20 warnings, 0 failures, 0 exceptions

```

</details>
